<template>
  <div>
    <AppHeader />
    <div class="flex justify-center p-8 w-full h-full">
      <div class="welcome-banner relative max-w-5xl w-full">
              <!-- Lime glow effect -->
              <div class="absolute bottom-0 left-0 right-0 h-1 bg-gradient-to-r from-transparent via-lime-500 to-transparent shadow-glow"></div>
              
              <!-- Main card -->
              <div class="rounded-2xl border-3 p-10 border border-white/5 shadow-2xl">
                  <h1 class="text-4xl md:text-3xl unbounded-bold text-white mb-6 uppercase tracking-wide">
                      Свод правил проекта
                  </h1>
                  <p class="text-gray-300 text-lg leading-relaxed unbounded-light">
Правила проекта - это фундамент комфортной и честной игры. Они созданы, чтобы исключить конфликты и обеспечить порядок. Соблюдение правил - прямая обязанность каждого, кто заходит на сервер.

<br>
<br>
<span class="text-white text-lg leading-relaxed unbounded-light underline underline-offset-5 decoration-[#6ba712]">Раздел 1. Общие положения</span>
<br>
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">1.1</span> Создавая аккаунт на ресурсах Blossom, вы автоматически и безоговорочно подтверждаете свою ознакомленность и свое полное согласие с настоящим сводом правил, обязуетесь выполнять их.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">1.2</span> Администрация оставляет за собой право определения любых мер наказаний и их сроков на свое усмотрение, без объяснения причин и предъявления доказательств.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">1.3</span> Администрация проекта не несет никакой ответственности в случае неправильно переведенных денежных средств.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">1.4</span> Администрация оставляет за собой право не возвращать игровые вещи, утраченные в результате багов, ошибок, откатов и прочих непредвиденных случаев.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">1.5</span> Администрация оставляет за собой право вносить любые корректировки в правила без оповещения пользователей.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">1.6</span> Взлом аккаунта не является оправданием в случае, когда вас обвиняют в нарушении правил.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">1.7</span> Незнание правил не освобождает от ответственности.
<br>
<br><br>
<span class="text-white text-lg leading-relaxed unbounded-light underline underline-offset-5 decoration-[#6ba712]">Раздел 2. Игровой процесс</span>
<br><br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">2.1</span> Запрещено использование/хранение стороннего ПО, дающего любое преимущество над игроками (читы, клиенты, модификации, X-ray текстурпаки, любые виды кликеров, макросов и т.п.).
- Чистосердечное признание (до проверки) сокращает срок наказания до 2 недель.
Наказание: перманентная блокировка аккаунта. При рецидиве, перманентная блокировка без возможности разблокировки.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">2.2</span> Запрещено использование любых уязвимостей сервера (баги, дюпы, фичи и т.п.).
Наказание: блокировка аккаунта от суток.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">2.3</span> Запрещено использование непристойных ников (содержащих нецензурную лексику, оскорбления), ников, состоящих из случайного набора символов, а также ников, схожих с никами членов персонала проекта.
Наказание: перманентная блокировка аккаунта.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">2.4</span> Запрещено использование непристойных скинов (содержащих наготу, нацистскую символику, символику организаций запрещенных на территории РФ, либо текст, нарушающий раздел правил чата).
Наказание: предупреждение с просьбой сменить скин, в случае отказа/рецидива блокировка аккаунта от 3 суток.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">2.5</span> Запрещены попытки покупки/продажи чего-либо за неигровую валюту/ресурсы.
Наказание: изъятие ресурсов, перманентная блокировка аккаунта продавца без возможности разблокировки, блокировка аккаунта покупателя от 2 суток.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">2.6</span> Запрещено создание более двух аккаунтов.
- Мультиаккаунт — регистрация дополнительного аккаунта для одного человека.
Наказание: перманентная блокировка всех мультиаккаунтов, блокировка основного аккаунта от 3 суток.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">2.7</span> Запрещено пытаться обходить блокировку аккаунта/чата любыми способами.
Наказание: увеличение срока блокировки аккаунта/чата.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">2.8</span> Запрещена передача/продажа аккаунта кому-либо.
Наказание: перманентная блокировка аккаунта.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">2.9</span> Запрещено предпринимать попытки завладеть чужим аккаунтом.
Наказание: перманентная блокировка аккаунта.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">2.10</span> Запрещены попытки провокации/подстрекательства игроков на нарушение правил проекта.
Наказание: блокировка аккаунта от суток.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">2.11</span> Запрещена подделка доказательств.
Наказание: снятие обвинений/наказания с нарушителя (в случае его невиновности), блокировка аккаунта игрока, подделавшего доказательства, от 3 суток.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">2.12</span> Запрещено хранить в тайне любые сведения о нарушении правил другими игроками.
Наказание: блокировка аккаунта от 4 суток.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">2.13</span> Запрещено создание/использование/хранение предметов с несвойственными для них свойствами, нарушающих правила проекта или невозможных к добыче при обычной игре.
Наказание: изъятие предметов, блокировка аккаунта от 12 часов.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">2.14</span> Запрещено препятствовать работе персонала.
Наказание: кик/блокировка аккаунта от суток.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">2.15</span> Запрещена накрутка любой статистики каким-либо способом.
Наказание: аннулирование статистики, блокировка аккаунта от 3 суток.
<br>
<br>
<span class="text-white text-lg leading-relaxed unbounded-light underline underline-offset-5 decoration-[#6ba712]">Раздел 3. Общение & взаимодействие</span>
<br>
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">3.1</span> Запрещено оскорблять кого-либо, унижать честь и достоинство, заниматься троллингом/буллингом, проявлять аморальное/агрессивное поведение.
- Не приветствуется нецензурная лексика, в особенности чрезмерное её использование.
- Также рекомендуется воздержаться от использования жаргонных выражений и иностранных языков.
- Сообщения вида "Все на босса, кто не баба!" запрещены, поскольку оскорбляют всех тех, кто не откликнулся на призыв.
- Данное правило затрагивает не только чат, но и другие средства позволяющие передавать информацию: таблички, книги, названия приватных регионов и т.д.
Наказание: мут от часа/блокировка аккаунта от суток.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">3.2</span> Запрещено частое повторение сообщений схожих по смыслу, частое повторение символов.
Наказание: мут от 15 минут.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">3.3</span> Запрещено отправлять сообщения, не несущие смысловой нагрузки.
- Пустые сообщения.
- Сообщения, состоящие из случайного набора символов.
- Сообщения, состоящие только из упоминания игрока(-ов) (пример: "reinquisitor"/"Админы"/"Модер")
Наказание: кик, при рецидиве мут от 10 минут.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">3.4</span> Запрещено отправлять сообщения, состоящие более чем на 50% из слов, написанных в верхнем регистре (CAPS) или "заборчиком" (пример: "ВсЕм ПрИвЕт!").
Наказание: кик, при рецидиве мут от 10 минут.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">3.5</span> Запрещена реклама любых ресурсов, не связанных с проектом (упоминание может быть отнесено к рекламе).
Наказание: блокировка аккаунта от суток.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">3.6</span> Запрещено вводить в заблуждение игроков по техническим/игровым аспектам.
Наказание: мут от 3 часов.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">3.7</span> Запрещено распространение багов, дюпов, недоработок системы.
Наказание: блокировка аккаунта от 3 суток.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">3.8</span> Запрещена пропаганда или агитация, возбуждающие социальную, расовую, национальную или религиозную ненависть и вражду.
- Упоминание веществ, организаций и пр. запрещенного на территории Российской Федерации также под запретом.
Наказание: блокировка аккаунта от 3 суток
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">3.9</span> Запрещено оскорбление Администрации/проекта в целом.
Наказание: мут от 3 суток/перманентная блокировка аккаунта.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">3.10</span> Запрещено выдавать себя за представителя персонала проекта.
Наказание: блокировка аккаунта от суток.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">3.11</span> Запрещено оскорбление, унижение, ущемление персонала, принуждение к выполнению несвойственных ему обязанностей, цитирование его прав и обязанностей.
Наказание: блокировка аккаунта от 3 суток/перманентная блокировка аккаунта.
<br>
<span class="text-gray-500 text-lg leading-relaxed unbounded-light">3.12</span> Запрещены обсуждения, критика действий персонала в игровом чате в любом проявлении.
Наказание: кик/мут от суток/блокировка аккаунта от суток.
                  </p>
              </div>
          </div>
    </div>
  </div>
</template>

<script lang="ts" setup>

</script>

<style>

</style>